print ("Ποια ειναι η ηλικια σου?"),
age = input()
print ("Ποσο υψος εχεις?",)
height = input()
print ("Ποσο ειναι το βαρος σου?",)
weight = input()

print ("Εσυ εισαι %r χρονων, εχεις %r υψος και  %r κιλα βαρος." % (
    age, height, weight))
print('--------------------------------------------------------------------------------------------')
print ("Πρακτικη για τον καθενα.")
print ('You\'d θα πρέπει να γνωρίζουν \'bout escapes with \\ που κάνουν \n οι νέες γραμμές και \t tabs.')

poem = """
\tΤον υπεροχο κοσμο
με τη λογική τόσο σταθερά φυτεύονται
δεν μπορεί να διακρίνει \n οι ανάγκες της αγάπης
ούτε να κατανοήσει το πάθος από τη διαίσθηση
και απαιτεί μια εξήγηση
\n\t\t,όπου δεν υπάρχει κανένας.
"""
print ("-----------------------------------------------------------------------------")
print ('Aυτο ειναι ενα ποιημα',poem)
print ("-----------------------------------------------------------------------------")

five = 10 - 2 + 3 - 6
print ("10-2+3-6 :Αυτο θα πρεπει να ειναι πεντε: %s" % five)
def secret_formula(started):
      jelly_beans = started * 500
      jars = jelly_beans / 1000
      crates = jars / 100
      return jelly_beans, jars, crates

start_point = 10000
beans, jars, crates = secret_formula(start_point)

print ("Με σημείο εκκίνησης: %d" % start_point)
print ("Θα είχαμε %d φασόλια, %d βάζα, και %d κιβώτια." % (beans, jars, crates))

start_point = start_point / 10

print ("Μπορούμε επίσης να το κάνουμε με αυτό τον τρόπο:")
print ("Θα είχαμε %d φασόλια, %d βάζα, και %d κιβώτια." % secret_formula(start_point))
