the_count = [1, 2, 3, 4, 5]
fruits = ['μηλα', 'πορτοκαλια', 'ροδακινα', 'αχλαδια']
change = [1, 'πενες', 2, 'δεκαρες', 3, 'τεταρτα']

# Αυτή η πρώτη του είδους for-loop περνά μέσα από μια λίστα
print('Λιστα αριθμων',the_count)
for number in the_count:
    print ("Μετραω %d" % number)

# Ίδια όπως παραπάνω
print('Λιστα φρουτων',fruits)
for fruit in fruits:
    print ("Ενα φρουτο του τυπου: %s" % fruit)

# Επίσης, μπορούμε να πάμε σε μικτες λίστες(αριθμοι και λεξεις) 
# Παρατηρήσετε ότι πρέπει να χρησιμοποιήσετε r% αφού δεν ξέρουμε τι σημαίνει αυτό
print('Λιστα αλλαγη',change)
for i in change:
    print ("Πηρα %r" % i)

print('Aγορασα %s %s %s' %(the_count[2],change[1],fruits[2]))
# Μπορούμε να οικοδομήσουμε τις λίστες, πρώτη εκκίνηση με άδεια(elements=stoixeia)
elements = []
print('Στοιχεια,νεα λιστα',elements)
# Στη συνέχεια χρησιμοποιήστε τη λειτουργία σειρά για να κάνει 0-5 μετράει
for i in range(0, 6):
    print ("Προσθηκη  %d στη λιστα." % i)
    # Προσάρτηση(append) είναι μια συνάρτηση που οι κατάλογοι κατανοούν
    elements.append(i)

# Τώρα μπορούμε να τα εκτυπώσετε πολύ
for i in elements:
    print ("Στοιχειο ηταν: %d" % i)

print('----------------------------------------------------------------------------------------------------------------------------')
hairs = ['καστανα', 'μαυρα', 'κοκκινα' ]
eyes = ['καφε', 'μπλε', 'πρασινα']
weits = [1, 2, 3, 4]

print('Χρωμα μαλλιων',hairs)
for hair in hairs :
    print ("Χρωμα μαλλιων :  %s "  % hair)

print('Χρωμα ματιων',eyes)
for eye in eyes :
    print ("Χρωμα ματιων :  %s" % eye)

print('Bαρη', weits)
for weit in weits:
    print('Βαρη : %s' % weit)
print('O πρωτος μαθητης εχει μαλια:%s''..Mατια:%s''..και Nουμερο:%s'%(hairs[0],eyes[0],weits[0]))
print('O δευτερος μαθητης εχει μαλια:%s''..Mατια:%s''..και Nουμερο:%s'%(hairs[1],eyes[0],weits[3]))
m=input('Δωσε χρωμα μαλιων:')
h=input('Δωσε χρωμα ματιων:')
n=input('Δωσε νουμερο:')

#for hair,eye,weit in hairs,eyes,weits:
    #print(('Λιστα μικτη: %-25s %-20s %8s') % (hair ,eye ,weit))

print('Ο μαθητης εχει στοιχεια:Μαλια:%s..Ματια:%s..και Νoυμερo:%s'%(m,h,n))
