the_count = [1, 2, 3, 4, 5]
fruits = ['μηλα', 'πορτοκαλια', 'ροδακινα', 'αχλαδια']
change = [1, 'ευρω', 2, 'λεπτα', 3, 'τεταρτα']

# Αυτή η πρώτη του είδους for-loop περνά μέσα από μια λίστα
print('Λιστα αριθμων',the_count)
print('Μετραω:')
for number in the_count:
    print ("%d" % number)

# Ίδια όπως παραπάνω
print('Λιστα φρουτων',fruits)
print ('Ενα φρουτο του τυπου:')
for fruit in fruits:
    print ("%s" % fruit)

# Επίσης, μπορούμε να πάμε σε μικτες λίστες(αριθμοι και λεξεις) 
# Παρατηρήσετε ότι πρέπει να χρησιμοποιήσετε r% αφού δεν ξέρουμε τι σημαίνει αυτό
print('Λιστα αλλαγη',change)
print('Πηρα σε οριζοντια μορφη:',change)
print('Πηρα σε κατακορυφη μορφη:')
for i in change:
    print ("%r" % i)

print('Aγορασα %s %s %s' %(the_count[2],change[1],fruits[2]))
print('----------------------------------------------------------------------------------------------------------------------------')
# Μπορούμε να οικοδομήσουμε τις λίστες, πρώτη εκκίνηση με άδεια(elements=stoixeia)
elements = []
print('Στοιχεια,νεα λιστα',elements)
# Στη συνέχεια χρησιμοποιήστε τη λειτουργία σειρά για να κάνει 0-5 μετράει
print('Προσθηκη νεων στοιχειων στη λιστα:')
for i in range(0, 6):
     #"%d " % i
    # Προσάρτηση(append) είναι μια συνάρτηση που οι κατάλογοι κατανοούν
    elements.append(i)

# Τώρα μπορούμε να τα εκτυπώσετε πολύ
print('Τα στοιχεια ειναι οριζοντια:',elements)
print('Τα στοιχεια ειναι κατακορυφα:')
for i in elements:
    print ("%d" % i)

print('----------------------------------------------------------------------------------------------------------------------------')
hairs = ['καστανα', 'μαυρα', 'κοκκινα' ]
eyes = ['καφε', 'μπλε', 'πρασινα']
weits = [1, 2, 3, 4]

print('Χρωμα μαλλιων,oριζοντια:',hairs)
print('Χρωμα μαλλιων,κατακορυφα:')
for hair in hairs :
    print ("%s "  % hair)

print('Χρωμα ματιων οριζοντια:',eyes)
print('Χρωμα ματιων κατακορυφα:')
for eye in eyes :
    print ("%s" % eye)

print('Bαρη οριζοντια:', weits)
print('Bαρη κατακορυφα:')
for weit in weits:
    print('%s' % weit)
print('O πρωτος μαθητης εχει μαλια:%s''\n Mατια:%s''\n και Nουμερο:%s'%(hairs[0],eyes[0],weits[0]))
print('O δευτερος μαθητης εχει μαλια:%s''.. Mατια:%s''.. και Nουμερο:%s'%(hairs[1],eyes[0],weits[3]))
m=input('Δωσε χρωμα μαλιων:')
h=input('Δωσε χρωμα ματιων:')
n=input('Δωσε νουμερο:')

#for hair,eye,weit in hairs,eyes,weits:
    #print(('Λιστα μικτη: %-25s %-20s %8s') % (hair ,eye ,weit))

print('Ο μαθητης εχει στοιχεια:Μαλια:%s \nΜατια:%s \nκαι Νoυμερo:%s'%(m,h,n))
