# Εδώ θα βρείτε τα παραδείγματα που παρουσιαστηκαν στο 3ο
# μέρος του οδηγου "Μαθαινοντας την Python" όπως δημοσιεύθηκε
# στο www.GreekTuts.net.
#
# Επιμέλεια: Απόστολος Κρητικός (KrAp)

# Αλφαριθμητικά (Strings) -- συνέχεια... --

print()
print("**************** Αλφαριθμητικά ******************")
print()

print('Αλφαριθμητικα με συννενωση='"Are you suggesting" " coconuts migrate?") # Δύο αλφαριθμητικά μπορούν να συννενωθούν απλά παράθετοντάς τα
print('Με απλα εισαγωγικα=''Are you suggesting' ' coconuts migrate?') # Διπλά ή απλά εισαγωγικά δεν παίζουν ρόλο

print()

# Εναλλακτικά η συννένωση δύο αλφαριθμητικών μπορεί να επιτευχθει κάνοντας χρήση της .strip()
# συνάρτησης. Πρέπει αυστηρά να προηγείται το σύμβολο + του δεύτερου αλφαριθμητικου
print('Με χρηση της .strip() +=''Are you suggesting'.strip() + ' coconuts migrate?')
# και εδώ τα απλά ή διπλά εισαγωγικά δεν παίζουν ρόλο
print('Mε διπλα εισαγωγικα='"Are you suggesting".strip() + " coconuts migrate?")

print()

# Το αλφαριθμητικό ως πίνακας χαρακτήρων. Υπενθυμίζουμε οτι η αρίθμηση ξεκινάει από το 0
# Δηλαδή ο πρώτος χαρακτήρας βρίσκεται στη θέση 0.

text = "Are you suggesting coconuts migrate?"

print('Ο χαρακτηρας στη θεση 8 ειναι =', text[8] )        # Eπιστρέφει τον χαρακτήρα που βρίσκεται στη θέση 8

print('Οι χαρακτηρες σε θεση 0-3 ειναι =', text[0:3] )      # Επιστρέφει τους χαρακτήρες από τη θέση 0 ως τη θέση 3
print('Οι χαρακτηρες σε θεση 4-7 ειναι=', text[4:7] )

print('Επιστρεφει τους χαρακτηρες 19 και πριν=', text[:19] )      # Επιστρέφει τους χαρακτήρες από τη θέση 19 και πριν
print('Επιστρεφει τους χαρακτηρες 19 και μετα=', text[19:] )      # Επιστρέφει τους χαρακτήρες από τη θέση 19 και μετά

# Αρνητικοί δείκτες στον πίνακα χαρακτήρων

print( 'Επιστρεφει τον τελευταιο χαρακτηρα -1=',text[-1] )       # Επιστρέφει τον τελευταιο χαρακτήρα
print( 'Επιστρεφει τον προτελευταιο χαρακτηρα=', text[-2] )       # Επιστρέφει τον προ-τελευταίο χαρακτήρα    
print( 'Επιστρεφει τους 3 τελευταιους χαρακτηρες=', text[-3:] )      # Επιστρέφει τους 3 τελευταίους χαρακτήρες
print( 'Επιστρεφει απο τον 10 χαρακτηρα και πριν=', text[:-10] )     # Επιστρέφει τους χαρακτήρες από τη δέκατη από το τέλος θέση και πριν
print('Επιστρεφει τον πρωτο χαρακτηρα -0=', text[-0] )       # Επιστρέφει τον πρώτο χαρακτήρα αφου -0 = 0

print()

# ΣΗΜΕΙΩΣΗ: text[5] = 'd' δεν επιτρέπεται. Δεν μπορούμε δηλαδή να αναθέτουμε χαρακτήρες
# σε συγκεκριμένη θέση του αλφαριθμητικου (πράγμα που επιτρέπεται για παράδειγμα στην C

print()

# Μπορούμε να συνδυάσουμε συνένωση αλφαριθμητικών με τις δυνατότητες των πινάκων χαρακτήρων
print('Συννενωση αλφαριθμητικων με δυνατοτητες πινακων=', 'Do ' + text[4:] )

print()

# Hacks πινάκων χαρακτήρων

print('Επιστρεφει το τμημα απο 1:2000=' ,text[1:2000] )   # Επιστρέφει το τμήμα του πίνακα για το οποίο υπάρχουν χαρακτήρες
print('Επιστρεφει κενο χαρακτηρα 120:=', text[120:] )     # Επιστρέφει κενό χαρακτήρα
print('Επιστρεφει κενο χαρακτηρα 5:4=', text[5:4] )      # Επιστρέφει κενό χαρακτήρα
print( 'Επιστρεφει το τμημα με χαρακτηρες -100:=',text[-100:] )    # Επιστρέφει το τμήμα του πινακα για το οποίο υπάρχουν χαρακτήρες

# ΣΗΜΕΙΩΣΗ: Το text[-50] δεν επιτρέπεται.       

print()

# Εισαγωγή unicode χαρακτήρα. Χρησιμοποιουμε το \u ακολουθούμενο από τον κωδικό του χαρακτήρα
# που μας ενδιαφέρει. Στο παρακάτω παράδειγμα ο κωδικός 0020 είναι ο unicode κωδικός του
# χαρακτήρα space
#text1=('Are you suggesting...')
print('Λιστα=',text)
print ('Μεγεθος αλφαριθμητικου πριν=',len(text))
print('Προσθεση unicode 0020 στο space =', "Are\u0020you s..." ) 

# Μέγεθος αλφαριθμητικου

print('Mεγεθος αλφαριθμητικου τωρα=', len(text) )

print()
print("*********************** Λίστες *************************")
print()

# Λίστες

# Δηλώνονται σε τετραγωνικές αγκύλες [ ... ] και μπορούν να περιέχουν οποιονδήποτε τύπο
# δεδομενων που υποστηρίζεται από την Python

myList = ['monty', 'python', 999, 222]

print( 'Λιστα=',myList )         # Εμφανίζει την λίστα στην κονσόλα
print('1ο στοιχειο=', myList[0] )      # Εμφανίζει το πρώτο στοιχειο της λίστας
print( 'Τελευταιο στοιχειο=',myList[-1] )     # Εμφανίζει το τελευταίο στοιχείο της λίστας
print('Ολα εκτος πρωτου και τελευταιου=', myList[1:-1] )   # Εμφανίζει όλα τα στοιχεια εκτός του πρώτου και του τελευταίου

print()

# Εισαγωγή, διαγραφή και τροποποίηση στοιχειων λιστών

myList[1:1] = ['foo', 'foo2']   # Εισαγωγή στοιχείων
print('Εισαγωγη στοιχειων=', myList )

myList[0:2] = []                # Διαγραφή στοιχειων
print('Διαγραφη στοιχειων=', myList )

myList[0:2] = [1, 12]           # Τροποποίηση στοιχείων
print('Τροποποιηση στοιχειων 1,12=', myList )

myList[:0] = myList             # Εισαγωγή ενός αντιγράφου της λίστας στην αρχή της
print( 'Εισαγωγη αντιγραφου=',myList )

myList[:] = []                  # Καθαρισμός της λίστας
print('Καθαρισμος=', myList )

print()

myList = [1, 2, 3, 4, 5]
print ('Nεα λιστα=',myList)
print( 'Μεγεθος =',len( myList ) )          # Επιστρέφει το μέγεθος της λίστας
print()
# Εμφωλευμένες Λίστες

myNestedList = ["Holy", "Grail"]
myList = [myNestedList, "by", "Monty", "Python"]    # Μια λίστα μπορεί να ειναι μελος μιας άλλης λίστας
print ('Λιστα1=',myNestedList)
print ('Λιστα2=','by','Monty','Python')
print( 'Μια λιστα μεσα σε αλλη=',myList )

print()
# Προσθήκη στοιχείου στο τέλος της λίστας

myList.append("Team")
print('Προσθηκη στοιχειου=',myList)
