list = ['καιτη', 'γιαννης', 'βρασιδας']
list.append('κυριακος' )   ##προσθετει στο τελος της λιστας τον κυριακο
print ('Λιστα=',list)
print('---------------------------------------------------------------------------------------')
list.insert(0, 'μαρια')          ##στη θεση 0 στην αρχη βαζει το μαρια
print ('Θεση 0 βαζουμε το μαρια',list)
print('---------------------------------------------------------------------------------------')
list.extend(['υυυ', 'ζζζ'])   ##στο τελος της λιστας προσθετει υυυ,ζζζ
print ('Στο τελος της λιστας προσθετει υυυ,ζζζ ',list) ##εκτυπωση=μαρια,καιτη,γιαννης,βρασιδας,κυριακος,υυυ,ζζζ
print('---------------------------------------------------------------------------------------')
x= (list.index('καιτη')) ##=1
print ('H θεση του καιτη ειναι=',x)
print('---------------------------------------------------------------------------------------')
list.remove('γιαννης')       ##διαγραφει τον γιαννη
print ('Διαγραφη με remove(γιαννης),εχουμε λιστα=',list)
print('---------------------------------------------------------------------------------------')
list.pop(1)                      ##αφαιρει και επιστρεφει το 1=καιτη
print ('Διαγραφη του καιτη με pop(1),εχουμε λιστα=',list)##[χχχ,βρασιδας,κυριακος,υυυ,ζζζ]
