print('Λιστα=5,3,4,1,2')
print ('Λιστα στη σειρα αριθμητικα=',sorted([5,3,4,1,2]))#βαζει στη σειρα αριθμητικα
print('******************************************************************************')
print('Λιστα=αυτο ειναι περι μωρο δηλαδη καθολου βαδιζω')
print('Λιστα αλφαβητικα=',sorted("αυτο ειναι περι μωρο δηλαδη καθολου βαδιζω".split(), key=str.lower))#βαζει στη σειρα αλφαβητικα
print('******************************************************************************')
a = ['Λονδινο','Ρωμη',1452,9]
print ('Λιστα=',a)
a.append(114)#προσθετει το 114 στο τελος
print('Προσθεσαμε το 114 στο τελος=',a)
a.insert(2,'Παρισι')#προσθετει στη θεση 2 το παρισι
print ('Προσθεσαμε το Παρισι στη θεση 2=',a)
a.remove('Ρωμη')#αφαιρει την ρωμη
print ('Αφαιρεσαμε την Ρωμη=',a)
print('******************************************************************************')
student_tuples = [
       ('Γιαννης', 'A', 15),
       ('Τζινα', 'B', 12),
       ('Βρασιδας', 'B', 10),
        ]
print ('Λιστα=',student_tuples)
print ('Λιστα σε σειρα ηλικιας=',sorted(student_tuples, key=lambda student: student[2]))   # sort με ηλικια
