#h pio apli morfi pithagoriou theorimatos
print ('**************ΠΥΘΑΓΟΡΕΙΟ ΘΕΩΡΗΜΑ**************')
a= 3 #εισαγουμε τιμη στην μεταβλητη a
b=4 #εισαγουμε τιμη στην μεταβλητη b
print ('Η καθετη πλευρα a ειναι a=',a,'..και η καθετη πλευρα b ειναι b=',b)
x=a**2+b**2#εισαγουμε μεταβλητη x με τα τετραγωνα των a και b
print ('Το αθροισμα των τετραγωνων ειναι=',x)
print ('Η τετραγωνικη ριζα ειναι(υποτεινουσα)=',x**0.5)
print ('---------------------------------------------------------------------------------------------')
#pithagorio me math
import math
print ('**************ΠΥΘΑΓΟΡΕΙΟ ΘΕΩΡΗΜΑ**************')
a= 3 #εισαγουμε τιμη στην μεταβλητη a
b=4 #εισαγουμε τιμη στην μεταβλητη b
print ('Η καθετη πλευρα a ειναι a=',a,'..Η καθετη πλευρα b ειναι b=',b)
x=a**2+b**2#εισαγουμε μεταβλητη x με τα τετραγωνα των a και b
print ('Το αθροισμα των τετραγωνων ειναι=',x)
math.sqrt(x)#υπολογισμος τετραγωνικη ριζας
print ('Η τετραγωνικη ριζα ειναι(υποτεινουσα)=',math.sqrt(x))

print ('---------------------------------------------------------------------------------------------')
A=input('Δωσε την μια καθετη πλευρα Α=') 
A=float(A)
B=input('Δωσε την αλλη καθετη πλευρα Β= ')
B=float(B)
#x=pow(A,2)+pow(B,2)
x=A**2+B**2
math.sqrt(x)
print ('H υποτεινουσα ειναι= %.2f ' %math.sqrt(x))#me to 2f orizo posa dekadika tha exei


