#from numpy import array
from numpy import *
import numpy
a = array( [20,30,40,50] )
print ('a=',a)
b = arange( 4 )
#b
array([0,1,2,3])
print ('b=',b)
c = a-b                           #αφαιρεση
#c
print ('array a-b=',c)
                                    #array([20, 29, 38, 47])
print ('_'*75)
#----------------------------------------------------------------------------------------------------------------------------
A = array( [[1,1],
                [0,1]] )
B = array( [[2,0],
                [3,4]] )
C=A*B                         # πολλαπλασιασμός στοιχείων
print ('A=\n',A)
print ('B=\n',B)
print ('array A*B=\n',C )
#----------------------------------------------------------------------------------------------------------------------------
print ('_'*75)
x=array([[2, 0],
             [0, 4]])           
y=array([[5, 4],
             [3, 4]])
z=numpy.dot(x,y)          # πολλαπλασιασμός πινάκων
print ('x=\n',x)
print ('y=\n',y)
print ('array x,y=\n',z)
