# strings

print ("Πιο γρηγορα 10 λεπτα") # απλη εκτυπωση
print ("Πιο γρηγορα %d  λεπτο " % (5 - 4)) # εκτυπωση κατα πραξη 5-4=1 
print ("Πιο γρηγορα 10 λεπτα".upper())  # εκτυπωση με κεφαλαια
print ("Πιο γρηγορα 10 λεπτα".lower())# εκτυπωση με μικρα
print ("Πιο γρηγορα 10 λεπτα".capitalize())# ?????
print ("Πιο γρηγορα 10 λεπτα"[3:]) # εκτυπωση απο τα τρια στοιχεια και μετα
print ("Πιο γρηγορα 10 λεπτα"[3:16]) # εκτυπωση απο τα τρια στοιχεια εως το 16
print ("Πιο γρηγορα 10 λεπτα"[-14:]) # εκτυπωση απο τo τελος τα 14 στοιχεια
val = int (125)
print (val) # εκτυπωση της val μονο για αριθμους

#Lists

x = 2                                                  # μεταβλητη x
z = ["λεπτα","δευτερολεπτα"]                     # μεταβλητη z
print ("Πιο γρηγορα %d %s" % ( x, z[x%2])) #εκτυπωσε πιο γρηγορα σε 2 λεπτα οριζοντια 

x += 1                                                #  μεταβλητη x+1
print ("Πιο γρηγορα %d %s" % ( x, z[x%2])) #εκτυπωσε πιο γρηγορα σε 3 δευτερολεπτα οριζοντια

d = "Πιο γρηγορα %d %s" % ( x, z[x%2]) #μεταβλητη για πιο γρηγορα σε 3 δευτερ.κατακορυφα                                                      
for character in d:
    print ("..%c.." % character)                 #εκτυπωση για πιο γρηγορα σε 3 δευτερ.κατακορυφα           
z = d.split() # χωρισε τις συλλαβες του z σε κομματια
print (z)
for item in z: # δωσε στην item την z
    print (item.count("γρηγορα")) # βρες την λεξη "γρηγορα" και δωσε 1 στο σημειο της

dir (z) # τα εκτυπωνει στην οθονη μονο στο κελυφος >>>

while z:
      try:
                  print  (z.pop()) # εκτυπωσε αναποδα μεσω βροχου
      except:
                  break
str = "this is only a test"
z=[]
for c in str:
     z.append (ord (c))# επιστρεφει το γραμμα σε νουμερο το κενο=32
...
print (z)

for x in range (0,len(z)) :
    print (z[x] % (x+1))

# Dictionary (Hashes)

dict = { "d" : "e", "f" :  [ "g" , 1, {  } ] }
print (dict) # εκτυπωση λιστας dict
print (dict.keys())# εκτυπωση στοιχειων με κλειδι
# dict.has_key("c") # ?????
#dict[0] #?????

print (dict[ 'd' ])# τι περιεχει το κλειδι d=e

# dict ['f '] #?????
print (dict ['f'] [0])# τι περιεχει το κλειδι f στη θεση 0=g
print (dict ['f'] [1])# τι περιεχει το κλειδι f στη θεση 1=1
print (dict ['f'] [2])# τι περιεχει το κλειδι f στη θεση 2={}
print (dict ['f'] [2].keys())
dict['f'] [2] ["test"] = "mable"
print(dict)
del dict ["f"] [1] # διεγραψε το στοιχειο 1 του κλειδιου f=1
print (dict)
