# strings

print ("Πιο γρηγορα 10 λεπτα") # απλη εκτυπωση
print ("Πιο γρηγορα %d  λεπτο(5-4=1) " % (5 - 4)) # εκτυπωση κατα πραξη 5-4=1 
print ("Πιο γρηγορα 10 λεπτα(KΕΦΑΛΑΙΑ)".upper())  # εκτυπωση με κεφαλαια
print ("Πιο γρηγορα 10 λεπτα(μικρα)".lower())# εκτυπωση με μικρα
print ("Πιο γρηγορα 10 λεπτα(Ξεκινα με κεφαλαιο)".capitalize())# ?????
print ("Πιο γρηγορα 10 λεπτα"[3:],'(Απο θεση 3 και μετα)') # εκτυπωση απο τα τρια στοιχεια και μετα
print ("Πιο γρηγορα 10 λεπτα"[3:16],'(Απο 3 θεση εως 16)') # εκτυπωση απο τα τρια στοιχεια εως το 16
print ("Πιο γρηγορα 10 λεπτα"[-14:],'(Απο το τελος 14 γραμματα)') # εκτυπωση απο τo τελος τα 14 στοιχεια
print('---------------------------------------------------------------------------------------------------------')
val = int (125)
print ('Εκτυπωση της τιμης=',val) # εκτυπωση της val μονο για αριθμους
print('---------------------------------------------------------------------------------------------------------')
#Lists

x = 2                                                  # μεταβλητη x
z = ["λεπτα","δευτερολεπτα"]                     # μεταβλητη z
print ("Πιο γρηγορα %d %s" % ( x, z[x%2])) #εκτυπωσε πιο γρηγορα σε 2 λεπτα οριζοντια 

x += 1                                                #  μεταβλητη x+1
print ("Πιο γρηγορα %d %s" % ( x, z[x%2])) #εκτυπωσε πιο γρηγορα σε 3 δευτερολεπτα οριζοντια

d = "Πιο γρηγορα %d %s" % ( x, z[x%2]) #μεταβλητη για πιο γρηγορα σε 3 δευτερ.κατακορυφα                                                      
for character in d:
    print ("..%c.." % character)                 #εκτυπωση για πιο γρηγορα σε 3 δευτερ.κατακορυφα           
z = d.split() # χωρισε τις συλλαβες του z σε κομματια
print (z)
print ('Βρες την λεξη "γρηγορα" και δωσε 1 στη θεση της:')
for item in z: # δωσε στην item την z
    print(item.count("γρηγορα")) # βρες την λεξη "γρηγορα" και δωσε 1 στο σημειο της

dir (z) # τα εκτυπωνει στην οθονη μονο στο κελυφος >>>
print  ('Eκτυπωσε αναποδα:')
while z:
      try:
                  print  (z.pop()) # εκτυπωσε αναποδα μεσω βροχου
      except:
                  break
print('-----------------------------------------------------------------------------------------')
str = "this is only a test"
z=[]
print('Aυτη ειναι λιστα για δοκιμη:',str)
for c in str:
     z.append (ord (c))# επιστρεφει το γραμμα σε νουμερο το κενο=32
...
print ('Επιστρεφει το γραμμα της λιστας σε νουμερο το κενο=32:',z)
print ('Επιστρεφει:')
for x in range (0,len(z)) :
    print (z[x] % (x+1))
print('-----------------------------------------------------------------------------------------')
# Dictionary (Hashes)

dict = { "d" : "e", "f" :  [ "g" , 1,{ } ] }
keys=list(dict.keys())
values=list(dict.values())
print ('Eκτυπωση λιστας',dict) # εκτυπωση λιστας dict
print ('Eκτυπωση στοιχειων με κλειδι',list(keys))# εκτυπωση στοιχειων με κλειδι
print('Eπιστρεφει το κενο:',list(c)) # ?????
#print(dict(0)) #?????

print ('Tι περιεχει το κλειδι d=',dict[ 'd' ])# τι περιεχει το κλειδι d=e

#print(list('g')  ) #?????
print ('Tι περιεχει το κλειδι f στη θεση 0=',dict ['f'] [0])# τι περιεχει το κλειδι f στη θεση 0=g
print ('Tι περιεχει το κλειδι f στη θεση 1=',dict ['f'] [1])# τι περιεχει το κλειδι f στη θεση 1=1
print ('Tι περιεχει το κλειδι f στη θεση 2=',dict ['f'] [2])# τι περιεχει το κλειδι f στη θεση 2={}
print ('Εκτυπωσε τη θεση 2 και τα κλειδια του λεξικου=',dict ['f'] [2],(keys))
dict['f'] [2] ["test"] = "mable"
print('Προσθεσε στη θεση 2 test:mable=',dict)
del dict ["f"] [1] # διεγραψε το στοιχειο 1 του κλειδιου f=1
print ('Διεγραψε τη θεση 1 του κλειδιου f=',dict)
print('-----------------------------------------------------------------------------------------')
def perm(l):
        # Compute the list of all permutations of l
    if len(l) <= 1:
                  return [l]
    r = []  # here is new list with all permutations!
    for i in range(len(l)):
             s = l[:i] + l[i+1:]
             p = perm(s)
             for x in p:
              r.append(l[i:i+1] + x)
    return r
#==============================================
a=[1,2,3]
print('Aλλαξε την σειρα των στοιχειων της λιστας',perm(a))
