my_list=[] #Κενή λίστα[]
print ('Κενη λιστα',my_list)
print('---------------------------------------------------------------------------------------')
my_list.append(1) #Η λίστα: [1],προσθετει το [1]
print ('Προσθεσε το 1.Λιστα=',my_list)
print('---------------------------------------------------------------------------------------')
my_list.extend([2,3,4]) #Η λίστα: [1,2,3,4],προσθετει το [2,3,4]
print ('Προσθεσε το 2,3,4.Λιστα=',my_list)
print('---------------------------------------------------------------------------------------')
my_list.insert(2,0) #Η λίστα: [0,1,2,3,4],προσθετει στη 2 θεση το 0
print ('Προσθεσε το 0 στη θεση 2.Λιστα=',my_list)
print('---------------------------------------------------------------------------------------')
list= []   ##ξεκινημα κενης λιστας
print ('Κενη λιστα',list)
print('---------------------------------------------------------------------------------------')
list.append ('α') ##προσθετει στη λιστα το 'α'
print ('Προσθεσε το (α).Εχουμε λιστα=',list)
print('---------------------------------------------------------------------------------------')
list.append ('β') ##προσθετει το β
print('Προσθεσε το (β).Εχουμε λιστα=',list)
