leksiko = {
	'Ονομα'        : 'Βρασιδας',
	'Επιθετο'      : 'Κατης',
	'Πολη'          :'Αθηνα',
	'Οδος'          :'Λημνου 21'
}
print ('Λιστα=',leksiko['Επιθετο'], leksiko['Ονομα'], leksiko['Πολη'], leksiko['Οδος'])# εκτυπωσε το λεξικο
print('Ονομα:',leksiko['Ονομα'],',Επιθετο:',leksiko['Επιθετο'])
print('-------------------------------------------------------------------------------------------')
f = open('data.txt', 'r') # ανοιξε το αρχειο .txt για διαβασμα= με μεταβλητη f
x = f.read()                  # διαβασε την f = με μεταβλητη x
f.close()                       # κλεισε το αρχειο
print ('Tα δεδομενα του αρχειου:\n',x)                      # εκτυπωσε την x που ειναι τα δεδομενα του αρχειου
print('-------------------------------------------------------------------------------------------')
a = x.split('\n')             # καταχωρισε την  x= με a ως προς \next
print ('Θεση -2:\n',a[-2])                       # εκτυπωσε την a που ειναι τα δεδομενα του αρχειου ως προς n
print('-------------------------------------------------------------------------------------------')
for k in a:                   # δωσε τα δεδομενα της a στην k
   print ('Εκτυπωσε τα 25 πρωτα γραμματα:\n',k[:25])                  # εκτυπωσε την k
print('-------------------------------------------------------------------------------------------')
p=k.split(',')#me entolh to ισον
u = a[0].split(',')
g = a[1].split(',')
e=a[2].split(',')
j=a[3].split(',')
print('Eκτυπωση αρχειου με δυο τροπους:')
print(u[0],',',g[0],',\n',e[0],',',j[0])
print()
print('Oνομα:', u[1],',Eπιθετο:',g[1],',Μενει σε:',e[1],'Kαι οδο:',j[1])
print('-----------------------------------------------------------------------------------------------------')
print ('Θεση 0:\n',(p[0]))
print ('Θεση 0 με κενο:\n' "\t",p[0])
print ('Θεση 0 και 1 με κενο:\n',p[0],"\t", p[1])
