leksiko = {
	'Ονομα'        : 'Βρασιδας',
	'Επιθετο'      : 'Κατης',
	'Πολη'          :'Αθηνα',
	'Οδος'          :'Λημνου 21'
}
print ('Λιστα=',leksiko['Επιθετο'], leksiko['Ονομα'], leksiko['Πολη'], leksiko['Οδος'])# εκτυπωσε το λεξικο
print('-------------------------------------------------------------------------------------------')
f = open('data.txt', 'r') # ανοιξε το αρχειο .txt για διαβασμα= με μεταβλητη f
x = f.read()                  # διαβασε την f = με μεταβλητη x
f.close()                       # κλεισε το αρχειο
print (x)                      # εκτυπωσε την x που ειναι τα δεδομενα του αρχειου
print('-------------------------------------------------------------------------------------------')
a = x.split('\n')             # καταχωρισε την  x= με a ως προς \next
print (a[-4])                       # εκτυπωσε την a που ειναι τα δεδομενα του αρχειου ως προς n
print('-------------------------------------------------------------------------------------------')
for k in a:                   # δωσε τα δεδομενα της a στην k
   print (k[:10])                  # εκτυπωσε την k
print('-------------------------------------------------------------------------------------------')
p = k.split('=')
print (p[1])
print (p[0],"\t", p[1])
print ("\t",p[1])
#???????????????????????????
