a=['London','Rome',1452,9]# κατασκευη λιστας
print 'Λιστα =',(a)
print 'Θεση 0=',(a[0])#εκτυπωση της θεσης 0 της λιστας=london,[0,1,2,3,4....] ή [....-3,-2,-1]
print 'Θεση 2=',(a[2])#εκτυπωση της θεσης 2 της λιστας
print 'Προσθεση θεσης 0 και 1=', (a[0 ] + a[1]) # προσθετει τις δυο θεσεις απο την λιστα [0+1]
print 'Προσθεση θεσης 2 και 3(αριθμοι)=',(a[2] + a[3])# προσθετει τις δυο θεσεις απο την λιστα [2+3],προσοχη ομως γιατι και τα δυο ειναι αριθμοι
print 'Προσθεση θεση 0 και 2(προσοχη θεση 2 αριθμος)=',a[0],+a[2]# βγαζει μηνυμα λαθους γιατι και τα δυο δεν εχουν μελη=strings
print 'Θεση 3=',(a[3])
print 'Θεση -2=',(a[-2])
print 'Θεση 1 εως 3=',a[1:3]# εκτυπωση των θεσεων 1 εως 3 χωρις να εχει το 3.
print 'Θεση 1 εως -1=',(a[1:-1])# εκτυπωση των θεσεων με αρνητικους αριθμους
print 'Θεση 0 εως 3=',(a[:3])  # εκτυπωση των θεσεων 0 εως 3, το 0 το εννοει.
a.append(114)# προσθεσε τo 114 στη λιστα
print 'Προσθετουμε το 114=',(a)
a.insert(2,'Paris')# προσθετει νεο μελος σε συγκεκριμενη θεση
print 'Προσθετουμε Paris σε θεση 2=',(a)
a.extend(['Milano',1812])#προσθετει στο τελος της λιστας
print 'Προσθετουμε,Milano και 1812 στο τελος της λιστας=',(a)
a.remove(9)#αφαιρουμε απο τη λιστα ενα γνωστο μελος[0,1,2....]
print 'Αφαιρεση του 9 στοιχειου=',(a)
c=a.pop()# αφαιρει το τελευταιο μελος της λιστας και το επιστρεφει
print 'Εκτυπωση του τελευταιου μελους=',(c) # εκτυπωση του τελευταιου μελους για να ξερουμε
print 'Αφαιρεση του τελευταιου μελους=',(a) # εκτυπωση για επαληθευση
print 'Θεση ενος γνωστου στοιχειου-1452,=',(a.index(1452)) # σε ενα γνωστο στοιχειο της λιστας μας επιστρεφει την (θεση του) στη λιστα
print 'Ποσα μελη εχει η λιστα=',len (a)# ποσα μελη εχει μια λιστα
# αν ειναι αριθμοι παιρνω το αθροισμα τους a=[1,2,3,4]->sum(a)=10
print 'Εκτυπωση οχτω αριθμων=', range (8)# εκτυπωση ενος συνολου αριθμων
print 'Εκτυπωση απο πεντε μεχρι οχτω=', range (5,15)#εκτυπωση ενος συνολου αριθμων
print 'Εκτυπωση απο 0 εως 30 με βημα 5=', range (0,30,5) #τo 5 ειναι βημα,αν βαλω κομα στο τελος εκτυπωνει και την αλλη γραμμη μαζι
print 'Εκτυπωση απο 100 εως 0 με βημα -20=', range (100,0,-20)
